ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/instance/pio.h
  #define REG_PIO_P_IER0    (*(__O  uint32_t*)0x40049020U) /**< \brief (PIOA) Privilege PIO Interrupt Enable Register (io_group = 0) */
  #define REG_PIO_P_IDR0    (*(__O  uint32_t*)0x40049024U) /**< \brief (PIOA) Privilege PIO Interrupt Disable Register (io_group = 0) */
  #define REG_PIO_P_IMR0    (*(__I  uint32_t*)0x40049028U) /**< \brief (PIOA) Privilege PIO Interrupt Mask Register (io_group = 0) */
  #define REG_PIO_P_ISR0    (*(__I  uint32_t*)0x4004902CU) /**< \brief (PIOA) Privilege PIO Interrupt Status Register (io_group = 0) */
  #define REG_PIO_P_SIONR0  (*(__O  uint32_t*)0x40049030U) /**< \brief (PIOA) Privilege PIO Set I/O Non-Secure Register (io_group = 0) */
  #define REG_PIO_P_SIOSR0  (*(__O  uint32_t*)0x40049034U) /**< \brief (PIOA) Privilege PIO Set I/O Secure Register (io_group = 0) */
  #define REG_PIO_P_IOSSR0  (*(__I  uint32_t*)0x40049038U) /**< \brief (PIOA) Privilege PIO I/O Security Status Register (io_group = 0) */
  #define REG_PIO_P_IOFR0   (*(__O  uint32_t*)0x4004903CU) /**< \brief (PIOA) Privilege PIO I/O Freeze Configuration Register (io_group = 0) */
  #define REG_PIO_P_MSKR1   (*(__IO uint32_t*)0x40049040U) /**< \brief (PIOB) Privilege PIO Mask Register (io_group = 1) */
  #define REG_PIO_P_CFGR1   (*(__IO uint32_t*)0x40049044U) /**< \brief (PIOB) Privilege PIO Configuration Register (io_group = 1) */
  #define REG_PIO_P_PDSR1   (*(__I  uint32_t*)0x40049048U) /**< \brief (PIOB) Privilege PIO Pin Data Status Register (io_group = 1) */
  #define REG_PIO_P_LOCKSR1 (*(__I  uint32_t*)0x4004904CU) /**< \brief (PIOB) Privilege PIO Lock Status Register (io_group = 1) */
  #define REG_PIO_P_SODR1   (*(__O  uint32_t*)0x40049050U) /**< \brief (PIOB) Privilege PIO Set Output Data Register (io_group = 1) */
  #define REG_PIO_P_CODR1   (*(__O  uint32_t*)0x40049054U) /**< \brief (PIOB) Privilege PIO Clear Output Data Register (io_group = 1) */
  #define REG_PIO_P_ODSR1   (*(__IO uint32_t*)0x40049058U) /**< \brief (PIOB) Privilege PIO Output Data Status Register (io_group = 1) */
  #define REG_PIO_P_IER1    (*(__O  uint32_t*)0x40049060U) /**< \brief (PIOB) Privilege PIO Interrupt Enable Register (io_group = 1) */
  #define REG_PIO_P_IDR1    (*(__O  uint32_t*)0x40049064U) /**< \brief (PIOB) Privilege PIO Interrupt Disable Register (io_group = 1) */
  #define REG_PIO_P_IMR1    (*(__I  uint32_t*)0x40049068U) /**< \brief (PIOB) Privilege PIO Interrupt Mask Register (io_group = 1) */
  #define REG_PIO_P_ISR1    (*(__I  uint32_t*)0x4004906CU) /**< \brief (PIOB) Privilege PIO Interrupt Status Register (io_group = 1) */
  #define REG_PIO_P_SIONR1  (*(__O  uint32_t*)0x40049070U) /**< \brief (PIOB) Privilege PIO Set I/O Non-Secure Register (io_group = 1) */
  #define REG_PIO_P_SIOSR1  (*(__O  uint32_t*)0x40049074U) /**< \brief (PIOB) Privilege PIO Set I/O Secure Register (io_group = 1) */
  #define REG_PIO_P_IOSSR1  (*(__I  uint32_t*)0x40049078U) /**< \brief (PIOB) Privilege PIO I/O Security Status Register (io_group = 1) */
  #define REG_PIO_P_IOFR1   (*(__O  uint32_t*)0x4004907CU) /**< \brief (PIOB) Privilege PIO I/O Freeze Configuration Register (io_group = 1) */
  #define REG_PIO_P_MSKR2   (*(__IO uint32_t*)0x40049080U) /**< \brief (PIOC) Privilege PIO Mask Register (io_group = 2) */
  #define REG_PIO_P_CFGR2   (*(__IO uint32_t*)0x40049084U) /**< \brief (PIOC) Privilege PIO Configuration Register (io_group = 2) */
  #define REG_PIO_P_PDSR2   (*(__I  uint32_t*)0x40049088U) /**< \brief (PIOC) Privilege PIO Pin Data Status Register (io_group = 2) */
  #define REG_PIO_P_LOCKSR2 (*(__I  uint32_t*)0x4004908CU) /**< \brief (PIOC) Privilege PIO Lock Status Register (io_group = 2) */
  #define REG_PIO_P_SODR2   (*(__O  uint32_t*)0x40049090U) /**< \brief (PIOC) Privilege PIO Set Output Data Register (io_group = 2) */
  #define REG_PIO_P_CODR2   (*(__O  uint32_t*)0x40049094U) /**< \brief (PIOC) Privilege PIO Clear Output Data Register (io_group = 2) */
  #define REG_PIO_P_ODSR2   (*(__IO uint32_t*)0x40049098U) /**< \brief (PIOC) Privilege PIO Output Data Status Register (io_group = 2) */
  #define REG_PIO_P_IER2    (*(__O  uint32_t*)0x400490A0U) /**< \brief (PIOC) Privilege PIO Interrupt Enable Register (io_group = 2) */
  #define REG_PIO_P_IDR2    (*(__O  uint32_t*)0x400490A4U) /**< \brief (PIOC) Privilege PIO Interrupt Disable Register (io_group = 2) */
  #define REG_PIO_P_IMR2    (*(__I  uint32_t*)0x400490A8U) /**< \brief (PIOC) Privilege PIO Interrupt Mask Register (io_group = 2) */
  #define REG_PIO_P_ISR2    (*(__I  uint32_t*)0x400490ACU) /**< \brief (PIOC) Privilege PIO Interrupt Status Register (io_group = 2) */
  #define REG_PIO_P_SIONR2  (*(__O  uint32_t*)0x400490B0U) /**< \brief (PIOC) Privilege PIO Set I/O Non-Secure Register (io_group = 2) */
  #define REG_PIO_P_SIOSR2  (*(__O  uint32_t*)0x400490B4U) /**< \brief (PIOC) Privilege PIO Set I/O Secure Register (io_group = 2) */
  #define REG_PIO_P_IOSSR2  (*(__I  uint32_t*)0x400490B8U) /**< \brief (PIOC) Privilege PIO I/O Security Status Register (io_group = 2) */
  #define REG_PIO_P_IOFR2   (*(__O  uint32_t*)0x400490BCU) /**< \brief (PIOC) Privilege PIO I/O Freeze Configuration Register (io_group = 2) */
  #define REG_PIO_P_SCDR    (*(__IO uint32_t*)0x40049500U) /**< \brief (PIOA/B/C) Privilege PIO Slow Clock Divider Debouncing Register */
  #define REG_PIO_P_WPMR    (*(__IO uint32_t*)0x400495E0U) /**< \brief (PIOA/B/C) Privilege PIO Write Protection Mode Register */
  #define REG_PIO_P_WPSR    (*(__I  uint32_t*)0x400495E4U) /**< \brief (PIOA/B/C) Privilege PIO Write Protection Status Register */
  #define REG_PIO_MSKR3     (*(__IO uint32_t*)0x4800C000U) /**< \brief (PIOD) PIO Mask Register (io_group = 0) */
  #define REG_PIO_CFGR3     (*(__IO uint32_t*)0x4800C004U) /**< \brief (PIOD) PIO Configuration Register (io_group = 0) */
  #define REG_PIO_PDSR3     (*(__I  uint32_t*)0x4800C008U) /**< \brief (PIOD) PIO Pin Data Status Register (io_group = 0) */
  #define REG_PIO_LOCKSR3   (*(__I  uint32_t*)0x4800C00CU) /**< \brief (PIOD) PIO Lock Status Register (io_group = 0) */
  #define REG_PIO_SODR3     (*(__O  uint32_t*)0x4800C010U) /**< \brief (PIOD) PIO Set Output Data Register (io_group = 0) */
  #define REG_PIO_CODR3     (*(__O  uint32_t*)0x4800C014U) /**< \brief (PIOD) PIO Clear Output Data Register (io_group = 0) */
  #define REG_PIO_ODSR3     (*(__IO uint32_t*)0x4800C018U) /**< \brief (PIOD) PIO Output Data Status Register (io_group = 0) */
  #define REG_PIO_IER3      (*(__O  uint32_t*)0x4800C020U) /**< \brief (PIOD) PIO Interrupt Enable Register (io_group = 0) */
  #define REG_PIO_IDR3      (*(__O  uint32_t*)0x4800C024U) /**< \brief (PIOD) PIO Interrupt Disable Register (io_group = 0) */
  #define REG_PIO_IMR3      (*(__I  uint32_t*)0x4800C028U) /**< \brief (PIOD) PIO Interrupt Mask Register (io_group = 0) */
  #define REG_PIO_ISR3      (*(__I  uint32_t*)0x4800C02CU) /**< \brief (PIOD) PIO Interrupt Status Register (io_group = 0) */
  #define REG_PIO_IOFR3     (*(__O  uint32_t*)0x4800C03CU) /**< \brief (PIOD) PIO I/O Freeze Configuration Register (io_group = 0) */
  #define REG_PIO_SCDR3     (*(__IO uint32_t*)0x4800C500U) /**< \brief (PIOD) PIO Slow Clock Divider Debouncing Register */
  #define REG_PIO_WPMR3     (*(__IO uint32_t*)0x4800C5E0U) /**< \brief (PIOD) PIO Write Protection Mode Register */
  #define REG_PIO_WPSR3     (*(__I  uint32_t*)0x4800C5E4U) /**< \brief (PIOD) PIO Write Protection Status Register */
  #define REG_PIO_P_MSKR3   (*(__IO uint32_t*)0x4800C000U) /**< \brief (PIOD) Privilege PIO Mask Register (io_group = 0) */
  #define REG_PIO_P_CFGR3   (*(__IO uint32_t*)0x4800C004U) /**< \brief (PIOD) Privilege PIO Configuration Register (io_group = 0) */
  #define REG_PIO_P_PDSR3   (*(__I  uint32_t*)0x4800C008U) /**< \brief (PIOD) Privilege PIO Pin Data Status Register (io_group = 0) */
  #define REG_PIO_P_LOCKSR3 (*(__I  uint32_t*)0x4800C00CU) /**< \brief (PIOD) Privilege PIO Lock Status Register (io_group = 0) */
  #define REG_PIO_P_SODR3   (*(__O  uint32_t*)0x4800C010U) /**< \brief (PIOD) Privilege PIO Set Output Data Register (io_group = 0) */
  #define REG_PIO_P_CODR3   (*(__O  uint32_t*)0x4800C014U) /**< \brief (PIOD) Privilege PIO Clear Output Data Register (io_group = 0) */
  #define REG_PIO_P_ODSR3   (*(__IO uint32_t*)0x4800C018U) /**< \brief (PIOD) Privilege PIO Output Data Status Register (io_group = 0) */
  #define REG_PIO_P_IER3    (*(__O  uint32_t*)0x4800C020U) /**< \brief (PIOD) Privilege PIO Interrupt Enable Register (io_group = 0) */
  #define REG_PIO_P_IDR3    (*(__O  uint32_t*)0x4800C024U) /**< \brief (PIOD) Privilege PIO Interrupt Disable Register (io_group = 0) */
  #define REG_PIO_P_IMR3    (*(__I  uint32_t*)0x4800C028U) /**< \brief (PIOD) Privilege PIO Interrupt Mask Register (io_group = 0) */
  #define REG_PIO_P_ISR3    (*(__I  uint32_t*)0x4800C02CU) /**< \brief (PIOD) Privilege PIO Interrupt Status Register (io_group = 0) */
  #define REG_PIO_P_SIONR3  (*(__O  uint32_t*)0x4800C030U) /**< \brief (PIOD) Privilege PIO Set I/O Non-Secure Register (io_group = 0) */
  #define REG_PIO_P_SIOSR3  (*(__O  uint32_t*)0x4800C034U) /**< \brief (PIOD) Privilege PIO Set I/O Secure Register (io_group = 0) */
  #define REG_PIO_P_IOSSR3  (*(__I  uint32_t*)0x4800C038U) /**< \brief (PIOD) Privilege PIO I/O Security Status Register (io_group = 0) */
  #define REG_PIO_P_IOFR3   (*(__O  uint32_t*)0x4800C03CU) /**< \brief (PIOD) Privilege PIO I/O Freeze Configuration Register (io_group = 0) */
  #define REG_PIO_P_SCDR3   (*(__IO uint32_t*)0x4800C500U) /**< \brief (PIOD) Privilege PIO Slow Clock Divider Debouncing Register */
  #define REG_PIO_P_WPMR3   (*(__IO uint32_t*)0x4800C5E0U) /**< \brief (PIOD) Privilege PIO Write Protection Mode Register */
  #define REG_PIO_P_WPSR3   (*(__I  uint32_t*)0x4800C5E4U) /**< \brief (PIOD) Privilege PIO Write Protection Status Register */

#endif /* (defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#endif /* _PIC32CX_PIO0A_INSTANCE_ */
